{
    "Experience Utilization enables agents to learn from ____ experiences": "past successes and failures",
    "The two main methods for acquiring experience are ____ and ____": "Internalization and Externalization",
    "In Internalization Method, experiences are embedded into the model's ____": "parameters",
    "In Externalization Method, experiences are stored in ____": "external memory",
    "Why does SFT often cause models to misuse tools?": "Over-interprets instructions and forces incorrect assumptions",
    "ToolRL uses ____ method combined with GRPO for optimization": "Reinforcement Learning",
    "The three components of ToolRL's reward design are ____, ____, and ____": "Format, Tool Name Match, Parameter Match",
    "Why does GRPO normalize rewards per-query rather than globally?": "To prevent unstable gradients when reward scales vary across queries",
    "LOOP models agent interaction as a ____ to handle partial observability": "POMDP (Partially Observable Markov Decision Process)",
    "In LOOP's Leave-One-Out advantage calculation, each trajectory is compared against ____": "the average of all other trajectories in the group",
    "Why does LOOP use token-level rewards instead of trajectory-level only?": "To link generation and rewards in single feedback loop for stable learning",
    "Reflexion converts RL rewards into ____ feedback": "verbal (or linguistic)",
    "The three key components of Reflexion are ____, ____, and ____": "Actor, Evaluator, Self-reflection",
    "Reflexion stores feedback with limited capacity of ____ experiences": "1 to 3",
    "Why does Reflexion avoid gradient-based learning?": "Uses verbal feedback through prompts instead of parameter updates",
    "ExpeL differs from Reflexion by learning across ____ rather than single tasks": "multiple environments (or tasks)",
    "The two phases in ExpeL are ____ and ____": "Training and Evaluation",
    "ExpeL uses four operators to refine insights: ____, ____, ____, ____": "ADD, EDIT, UPVOTE, DOWNVOTE",
    "Why does HotpotQA benefit more from insights than trajectory retrieval?": "Reasoning-intensive tasks need abstract guidance for synthesis across sources",
    "In AppWorld, agents interact with ____ apps through ____ APIs": "9 apps, 457 APIs",
    "The advantage of internalization methods is ____": "Experiences embedded in parameters enable direct application without retrieval",
    "The advantage of externalization methods is ____": "No parameter updates needed; flexible memory reuse across tasks"
  }