{
    "The main objective of a Tool Agent is to ____.": "Solve the user's requests",
    "Why must agents gather information from users through multi-turn questioning?": "To precisely understand and fulfill the user's exact intent",
    "In SWEET-RL, next-token prediction alone is inadequate for teaching agents ____ skills.": "Information gathering",
    "What type of model is used as the user simulator in the Feedback Reception task for frontend design?": "Vision Language Model (VLM)",
    "In SWEET-RL's multi-turn question task, the maximum number of turns allowed is ____.": "10 turns",
    "Why does SWEET-RL break down DPO learning into individual turns rather than using the entire trajectory?": "User-agent multi-turn interactions exhibit high variance, making it difficult to determine if specific utterances were appropriate",
    "What does the Advantage Model in SWEET-RL receive as input to calculate the advantage score?": "Dialogue history (o_t) and agent's utterance (a_t)",
    "In SWEET-RL, trajectories are classified as positive (τ+) or negative (τ-) based on ____.": "The reward of the trajectory",
    "Why do agent utterances that commonly occur in both τ+ and τ- not receive extreme advantage scores?": "The model learns to distinguish actions by their relative frequency in positive vs negative trajectories",
    "What metric is used to evaluate the Backend Programming task in SWEET-RL?": "% Tests Passed and Success Rate (unit tests)",
    "What metric is used to evaluate the Frontend Design task in SWEET-RL?": "Cosine Similarity and Win Rate against GPT-4o",
    "The 'Unavailable Service' non-collaborative user behavior stems from ____ in marketing studies.": "Customers with illegitimate complaints and unavailable service requests",
    "Why might a 'Tangential' user become frustrated during agent interaction?": "If the agent does not reply to their tangential utterances",
    "The 'Impatience' non-collaborative behavior is triggered when the agent ____ or takes too long.": "Notifies failure",
    "In the Incomplete Utterance simulation, what two methods are used to generate incomplete utterances?": "Using real-world incomplete utterances as few-shot examples and truncating generated utterances",
    "What is the role of the Dialogue State Tracker in the collaborative user simulator?": "Ensures the user provides all information specified in the user goal during conversation",
    "What is the role of the Ending Verifier in the collaborative user simulator?": "Prevents premature termination of the conversation",
    "In ProPerSim, user personas consist of which two main components?": "Personality and background",
    "How often does the user generate an action in the ProPerSim simulation environment?": "Every 10 to 30 minutes",
    "In ProPerSim, the agent must decide whether to make a recommendation every ____ minutes.": "2.5 minutes",
    "What four criteria are used to evaluate agent recommendations in ProPerSim?": "Personal Preference, Frequency, Timing, and Communication & Safety",
    "In ProPerSim, agent recommendations are evaluated using what type of evaluator?": "LLM-based evaluator",
    "Why do some personas in ProPerSim show poor training results according to the experiments?": "Their preferences require fact-based and critical thinking with context-dependent timing and frequency",
    "Which two evaluation criteria show the most significant improvement through DPO training in ProPerSim?": "Timing and Frequency",
    "What does S(a) consist of in the ProPerSim agent's recommendation generation?": "(A, R) pairs - action and recommendation pairs"
  }