{
    "A proactive dialogue system is a conversational AI system that takes the initiative to guide a conversation with ____.": "specific goals",
    "Dialogue policy planning determines what ____ the dialogue agent should take to effectively achieve specific goals.": "actions (or strategies)",
    "What are three approaches for training a policy planner mentioned in the lecture?": "Human-annotated datasets, AI-generated feedback, simulated future dialogue",
    "Why is dialogue simulation beneficial for training dialogue policy planners?": "Cost reduction, time efficiency, case scalability, and exploring diverse paths",
    "In reinforcement learning, the agent learns to make decisions by taking actions in an environment to maximize ____ over time.": "cumulative rewards",
    "What does GDP-ZERO stand for?": "Goal-oriented Dialogue Planning with Zero Training",
    "Why does GDP-ZERO not require human-annotated data or LLM training?": "It prompts an LLM (ChatGPT) to act as user simulator, system model, policy prior, and value function during MCTS simulation",
    "What are the four phases of Monte-Carlo Tree Search?": "Selection, Expansion, Simulation, Backpropagation",
    "In GDP-ZERO, what formula is used to select which action to traverse during the Selection phase?": "PUCT (Predictor Upper Confidence Tree Bound)",
    "In the PUCT formula, what does the term involving N(s,a) in the denominator encourage?": "Exploration of less-visited nodes",
    "In GDP-ZERO, what does the value function v(s^tr) represent?": "Probability that the dialogue context can lead to task success",
    "During GDP-ZERO's Prediction phase, the optimal action is selected based on ____.": "The number of times an action has been visited (arg max N)",
    "What is a key weakness of GDP-ZERO compared to PPDPP?": "Requires simulation for each case and response, increasing runtime and cost",
    "What does PPDPP stand for?": "Plug-and-Play Dialogue Policy Planner",
    "Why is PPDPP considered 'plug-and-play'?": "It can be applied to various applications by substituting the learned plug-in without modifying the LLMs",
    "PPDPP is trained in two phases: ____ followed by ____.": "Supervised Fine-tuning (SFT), Reinforcement Learning (RL)",
    "In PPDPP, what model architecture is used as the tunable policy planner?": "RoBERTa",
    "What are the three ChatGPT-based LLMs used during PPDPP's reinforcement learning phase?": "Dialog LLM, User LLM, Reward LLM",
    "The Dialog LLM generates system utterances based on dialogue history and ____.": "action prompt (from PPDPP)",
    "Why does the Reward LLM use temperature τ = 1.1 and sample multiple times (l = 10)?": "To obtain a stable averaged value estimate through multiple samples",
    "In PPDPP's RL training, what policy gradient method is used to optimize the policy planner?": "Vanilla policy gradient",
    "What metric measures the effectiveness of negotiation by calculating (Agreed Price - List Price) / (Agreed Price - Buyer Target Price)?": "Sale-to-List Ratio (SL%)",
    "Why does PPDPP outperform prompting-based methods like Proactive and ProCoT?": "PPDPP uses a trainable plug-in optimized through RL, not limited by frozen LLM planning capability",
    "In ESConv emotional support dialogues, what are the three main conversation stages?": "Exploration, Comforting, Action",
    "The PersuasionForGood (P4G) dataset aims to persuade users to ____.": "Donate part of their task earnings to charity (Save the Children)"
  }